var data = {
    "digital": {
        "materials": [
            //Материалы блока (тип бумаги). Можно изменить цену в зависимости от типа бумаги
            {
                "pp": "0.0124", //для изменения цены меняем этот коэффициент
                "id": "o80",
                "thickness": "0.1",
                "name": "Офсетная 80 г/м2"
            },
            {
                "pp": "0.0163",//для изменения цены меняем этот коэффициент
                "id": "o100",
                "thickness": "0.12",
                "name": "Офсетная 100 г/м2"
            },
            {
                "pp": "0.0188",//для изменения цены меняем этот коэффициент
                "id": "o120",
                "thickness": "0.14",
                "name": "Офсетная 120 г/м2"
            },
            {
                "pp": "0.0283",//для изменения цены меняем этот коэффициент
                "id": "o170",
                "thickness": "0.2",
                "name": "Офсетная 170 г/м2"
            },
            {
                "pp": "0.0048",//для изменения цены меняем этот коэффициент
                "id": "o80a4",
                "thickness": "0.1",
                "name": "Офсетная 80 г/м2 A4"
            },
            {
                "pp": "0.0096",//для изменения цены меняем этот коэффициент
                "id": "o80a3",
                "thickness": "0.1",
                "name": "Офсетная 80 г/м2 A3"
            },
            {
                "pp": "0.0163",//для изменения цены меняем этот коэффициент
                "id": "m115",
                "thickness": "0.1",
                "name": "Мелованная 115 г/м2"
            },
            {
                "pp": "0.0213",//для изменения цены меняем этот коэффициент
                "id": "m150",
                "thickness": "0.12",
                "name": "Мелованная 150 г/м2"
            },
            {
                "pp": "0.0283",//для изменения цены меняем этот коэффициент
                "id": "m200",
                "thickness": "0.2",
                "name": "Мелованная 200 г/м2"
            },
            {
                "pp": "0.0437",//для изменения цены меняем этот коэффициент
                "id": "m300",
                "thickness": "0.28",
                "name": "Мелованная 300 г/м2"
            },
            {
                "pp": "0.0511",//для изменения цены меняем этот коэффициент
                "id": "m350",
                "thickness": "0.3",
                "name": "Мелованная 350 г/м2"
            },
            {
                "pp": "0.045",//для изменения цены меняем этот коэффициент
                "id": "d100",
                "thickness": "0.12",
                "name": "DNS 100 г/м2"
            },
            {
                "pp": "0.05",//для изменения цены меняем этот коэффициент
                "id": "d120",
                "thickness": "0.14",
                "name": "DNS 120 г/м2"
            },
            {
                "pp": "0.08",//для изменения цены меняем этот коэффициент
                "id": "d160",
                "thickness": "0.19",
                "name": "DNS 160 г/м2"
            },
            {
                "pp": "0.12",//для изменения цены меняем этот коэффициент
                "id": "d200",
                "thickness": "0.23",
                "name": "DNS 200 г/м2"
            },
            {
                "pp": "0.15",//для изменения цены меняем этот коэффициент
                "id": "d300",
                "thickness": "0.35",
                "name": "DNS 300 г/м2"
            },
            {
                "pp": "0.0837",//для изменения цены меняем этот коэффициент
                "id": "raflatac",
                "thickness": "0.1",
                "name": "Самоклеющаяся бумага"
            },
            {
                "pp": "0.2626",//для изменения цены меняем этот коэффициент
                "id": "oracal",
                "thickness": "0.1",
                "name": "Самоклеющаяся пленка"
            },
            {
                "pp": "0.075",//для изменения цены меняем этот коэффициент
                "id": "karton270",
                "thickness": "0.45",
                "name": "Картон одностороннего мелования 270 г/м2"
            }
        ],
        "prices": {

            "color": [
                {
                    "cost": "0.7",
                    "range": "0-1",
                    "name": "Единичная"
                },
                {
                    "cost": "0.5",
                    "range": "2-20",
                    "name": "До 20"
                },
                {
                    "cost": "0.35",
                    "range": "21-50",
                    "name": "До 50"
                },
                {
                    "cost": "0.2",
                    "range": "51-200",
                    "name": "До 200"
                },
                {
                    "cost": "0.16",
                    "range": "201-1000",
                    "name": "До 1000"
                },
                {
                    "cost": "0.14",
                    "range": "1001-Infinity",
                    "name": "Свыше 1000"
                }
            ],

            "grayscale": [
                {
                    "cost": "0.02",
                    "range": "0-100",
                    "name": "До 100"
                },
                {
                    "cost": "0.016",
                    "range": "100-1000",
                    "name": "До 1000"
                },
                {
                    "cost": "0.013",
                    "range": "1001-10000",
                    "name": "До 10000"
                },
                {
                    "cost": "0.012",
                    "range": "10001-Infinity",
                    "name": "Свыше 10000"
                }
            ]
        }
    },
    "sets": {
        "usd": "30.5",
        "euro": "33",
        "incrase": "1.4",
        "incrase2": "1.6",
        "min": "100",
        "vat": "20",
        "delivery": "50",
        "design": "100"
    },
    "postpress": {
        "rounding": "30",
        "pasting-adhesive-tape": "1",
        "stamping": {
            "cliche": {
                "3mm": "0.25",
                "7mm": "0.5",
                "min": "100"
            },

            "prices": {
                "0-10": [
                    {
                        "first": "150",
                        "next": "100"
                    },
                    {
                        "first": "170",
                        "next": "100"
                    },
                    {
                        "first": "180",
                        "next": "120"
                    },
                    {
                        "first": "440",
                        "next": "270"
                    }
                ],
                "11-50": [
                    {
                        "first": "200",
                        "next": "150"
                    },
                    {
                        "first": "220",
                        "next": "170"
                    },
                    {
                        "first": "200",
                        "next": "150"
                    },
                    {
                        "first": "500",
                        "next": "300"
                    }
                ],
                "50-200": [
                    {
                        "first": "300",
                        "next": "250"
                    },
                    {
                        "first": "500",
                        "next": "300"
                    },
                    {
                        "first": "500",
                        "next": "300"
                    },
                    {
                        "first": "800",
                        "next": "500"
                    }
                ],
                "201-600": [
                    {
                        "first": "600",
                        "next": "400"
                    },
                    {
                        "first": "1000",
                        "next": "750"
                    },
                    {
                        "first": "900",
                        "next": "700"
                    },
                    {
                        "first": "1000",
                        "next": "800"
                    }
                ]
            }
        },
        "cutting": [
            {
                "quantityRange": "1-2",
                "sheetRanges": [
                    {
                        "cost": "22",
                        "range": "1-20"
                    },
                    {
                        "cost": "22",
                        "range": "21-99"
                    },
                    {
                        "cost": "12",
                        "range": "100-Infinity"
                    }
                ]
            },
            {
                "quantityRange": "3-8",
                "sheetRanges": [
                    {
                        "cost": "3",
                        "range": "1-20"
                    },
                    {
                        "cost": "22",
                        "range": "21-99"
                    },
                    {
                        "cost": "22",
                        "range": "100-Infinity"
                    }
                ]
            },
            {
                "quantityRange": "9-12",
                "sheetRanges": [
                    {
                        "cost": "44",
                        "range": "1-20"
                    },
                    {
                        "cost": "33",
                        "range": "21-99"
                    },
                    {
                        "cost": "22",
                        "range": "100-Infinity"
                    }
                ]
            },
            {
                "quantityRange": "13-24",
                "sheetRanges": [
                    {
                        "cost": "55",
                        "range": "1-20"
                    },
                    {
                        "cost": "88",
                        "range": "21-99"
                    },
                    {
                        "cost": "110",
                        "range": "100-Infinity"
                    }
                ]
            },
            {
                "quantityRange": "25-48",
                "sheetRanges": [
                    {
                        "cost": "110",
                        "range": "1-20"
                    },
                    {
                        "cost": "110",
                        "range": "21-99"
                    },
                    {
                        "cost": "170",
                        "range": "100-Infinity"
                    }
                ]
            },
            {
                "quantityRange": "48-Infinity",
                "sheetRanges": [
                    {
                        "cost": "130",
                        "range": "1-20"
                    },
                    {
                        "cost": "170",
                        "range": "21-99"
                    },
                    {
                        "cost": "220",
                        "range": "100-Infinity"
                    }
                ]
            }
        ],
        "crease": {
            "manual": {
                "1-20": "1.1",
                "21-100": "0.7",
                "101-500": "0.5",
                "501-2000": "0.4",
                "2001-Infinity": "0.3"
            },
            "auto": {
                "1-20": "1.1",
                "21-100": "0.7",
                "101-500": "0.3",
                "501-2000": "0.15",
                "2001-Infinity": "0.15"
            },
            "min": "30",
            "fitting": "60",
            "reserve": "5"
        },
        // Ламиниция (цена меняется в зависимости от размера)
        "lamination": {
            "min": "60",
            "ranges": {
                //размер
                "24-32": {
                    "thickness": "0.08",
                    "coated": "0.04", // глянцевая  для изменения цены меняем этот коэффициент
                    "matted": "0.05", // матовая     для изменения цены меняем этот коэффициент
                    "rates": {
                        "1-20": "6",
                        "21-50": "5",
                        "51-200": "4.5",
                        "201-Infinity": "4"
                    }
                },
                //размер
                "80-100": {
                    "thickness": "0.25",
                    "coated": "0.2", // глянцевая    для изменения цены меняем этот коэффициент
                    "matted": "0.39", // матовая    для изменения цены меняем этот коэффициент
                    "rates": {
                        "1-100": "3",
                        "101-Infinity": "2"
                    }
                },
                //размер
                "175": {
                    "thickness": "0.4",
                    "coated": "0.38", // глянцевая    для изменения цены меняем этот коэффициент
                    "matted": "0.71", // матовая    для изменения цены меняем этот коэффициент
                    "rates": {
                        "1-100": "3",
                        "101-Infinity": "2"
                    }
                }
            }
        },
        "digital-cutting": {
            "per-page": "7",
            "min": "100",
            "materials": [
                {
                    "rate": "1.0",
                    "title": "Самоклеющаяся пленка"
                },
                {
                    "rate": "1.0",
                    "title": "Самоклеющаяся бумага"
                },
                {
                    "rate": "1.2",
                    "title": "Бумага 200-350 грам"
                },
                {
                    "rate": "1.4",
                    "title": "Бумага с ламинацией, картоны 250-350 грам"
                }
            ],
            "rates": {
                "1-3": "1",
                "4-100": "1.2",
                "101-700": "4",
                "701-Infinity": "15.0"
            },
            "outset-cut-rate": {
                "1": "1",
                "2": "1.2",
                "3": "1.3",
                "4": "2",
                "5": "3"
            },
            "inset-cut-rate": {
                "1": "1.1",
                "2": "1.2",
                "3": "1.3",
                "4": "1.4",
                "5": "1.5"
            }
        },
        "drilling": {
            "ranges": {
                "1-500": "0.3",
                "501-2000": "0.2",
                "2001-10000": "0.1",
                "10000-Infinity": "0.08"
            },
            "min": "50"
        },
        "underframe": {
            "600x900": {
                "price": "3",
                "rate": "6"
            },
            "500x700": {
                "price": "2.4",
                "rate": "6"
            },
            "400x500": {
                "price": "1.8",
                "rate": "6"
            },
            "300x400": {
                "price": "1.4",
                "rate": "6"
            },
            "200x300": {
                "price": "1",
                "rate": "6"
            }
        },
        //Коэффициенты для изменения цены за вид переплета (в зависимости от тиража)
        "coefficients": {
            //пружины
            "spring": {
                //"1-10" и другие значения - это тираж
                "1-10": "5", //для изменения цены меняем этот коэффициент
                "11-50": "4",//для изменения цены меняем этот коэффициент
                "51-200": "2.5",//для изменения цены меняем этот коэффициент
                "200-500": "2",//для изменения цены меняем этот коэффициент
                "500-Infinity": "1.6"//для изменения цены меняем этот коэффициент
            },
            //болты и кольца
            "bolt-rings": {
                "1-20": "5",//для изменения цены меняем этот коэффициент
                "21-50": "4",//для изменения цены меняем этот коэффициент
                "51-200": "3",//для изменения цены меняем этот коэффициент
                "201-Infinity": "2"//для изменения цены меняем этот коэффициент
            }
        },
        //скобы как на тетрадь
        "staple": {
            "1-10": "15",//для изменения цены меняем этот коэффициент
            "11-50": "8",//для изменения цены меняем этот коэффициент
            "51-200": "4",//для изменения цены меняем этот коэффициент
            "201-500": "3",//для изменения цены меняем этот коэффициент
            "500-Infinity": "2.5"//для изменения цены меняем этот коэффициент
        },
        //термобиндер
        "thermo": {
            "1-5": "50",//для изменения цены меняем этот коэффициент
            "6-20": "40",//для изменения цены меняем этот коэффициент
            "21-50": "10",//для изменения цены меняем этот коэффициент
            "51-100": "7",//для изменения цены меняем этот коэффициент
            "101-Infinity": "5"//для изменения цены меняем этот коэффициент
        },
        "fastening": "1.5",
        "punching": "2",
        "punching-width": "3",
        "folders": {
            "pocket-cutting": "1.7",
            "folding": {
                "flat": "3",
                "bulk": "4"
            }
        }
    },
    "supplies": {
        "transparencies": "0.2",
        "cover": "0.08",
        "cringle": "0.50",
        "calendar": {
            "window": "0.06",
            "windowRate": "1.6",
            "block": "8",
            "blockRate": "1.6"
        },

        //Вид переплета (можно изменить цены в зависимости от толщины изделия)
        // Пружина
        "spring": {
            //металлическая
            "metall": {
                //диаметр пружины (меняется автоматически в зависимости от толщины изделия)
                "6.3": {
                    "cpr": "0.000875", //для изменения цены меняем этот коэффициент
                    "thickness": "4",
                    "step": "8.75"
                },
                "8": {
                    "cpr": "0.001275", //для изменения цены меняем этот коэффициент
                    "thickness": "6",
                    "step": "8.75"
                },
                "9.5": {
                    "cpr": "0.001595", //для изменения цены меняем этот коэффициент
                    "thickness": "7.5",
                    "step": "8.75"
                },
                "11": {
                    "cpr": "0.002178", //для изменения цены меняем этот коэффициент
                    "thickness": "9",
                    "step": "8.75"
                },
                "12.7": {
                    "cpr": "0.0025", //для изменения цены меняем этот коэффициент
                    "thickness": "10.5",
                    "step": "8.75"
                },
                "15.9": {
                    "cpr": "0.0059", //для изменения цены меняем этот коэффициент
                    "thickness": "14",
                    "step": "14"
                },
                "19": {
                    "cpr": "0.007857", //для изменения цены меняем этот коэффициент
                    "thickness": "16",
                    "step": "14"
                },
                "25.4": {
                    "cpr": "0.011388", //для изменения цены меняем этот коэффициент
                    "thickness": "22",
                    "step": "8.75"
                }
            },

            //пластиковая пружина
            "plastic": {
                //диаметр пружины (меняется автоматически в зависимости от толщины изделия)
                "6": {
                    "cps": "0.027", //для изменения цены меняем этот коэффициент
                    "thickness": "2"
                },
                "8": {
                    "cps": "0.033", //для изменения цены меняем этот коэффициент
                    "thickness": "4"
                },
                "10": {
                    "cps": "0.038", //для изменения цены меняем этот коэффициент
                    "thickness": "5.5"
                },
                "12": {
                    "cps": "0.053", //для изменения цены меняем этот коэффициент
                    "thickness": "8"
                },
                "14": {
                    "cps": "0.062", //для изменения цены меняем этот коэффициент
                    "thickness": "10"
                },
                "16": {
                    "cps": "0.078", //для изменения цены меняем этот коэффициент
                    "thickness": "12"
                },
                "19": {
                    "cps": "0.094", //для изменения цены меняем этот коэффициент
                    "thickness": "15"
                },
                "22": {
                    "cps": "0.124", //для изменения цены меняем этот коэффициент
                    "thickness": "18"
                },
                "28": {
                    "cps": "0.188", //для изменения цены меняем этот коэффициент
                    "thickness": "24"
                },
                "32": {
                    "cps": "0.216", //для изменения цены меняем этот коэффициент
                    "thickness": "28"
                },
                "45": {
                    "cps": "0.244", //для изменения цены меняем этот коэффициент
                    "thickness": "40"
                },
                "51": {
                    "cps": "0.266", //для изменения цены меняем этот коэффициент
                    "thickness": "45"
                }
            }
        },
        //болты.
        // Цена зависит от толщины (thickness), которая определяется автоматически
        "bolt": {
            "5": {
                "cost": "0.065", //для изменения цены меняем этот коэффициент
                "thickness": "5-8"
            },
            "10": {
                "cost": "0.07", //для изменения цены меняем этот коэффициент
                "thickness": "10-13"
            },
            "20": {
                "cost": "0.082", //для изменения цены меняем этот коэффициент
                "thickness": "20-23"
            },
            "30": {
                "cost": "0.09", //для изменения цены меняем этот коэффициент
                "thickness": "30-33"
            },
            "40": {
                "cost": "0.12", //для изменения цены меняем этот коэффициент
                "thickness": "40-43"
            },
            "50": {
                "cost": "0.14", //для изменения цены меняем этот коэффициент
                "thickness": "50-53"
            },
            "60": {
                "cost": "0.16", //для изменения цены меняем этот коэффициент
                "thickness": "60-63"
            }
        },
        //кольца
        //Цена зависит от толщины (thickness), которая определяется автоматически
        "ring": {
            "14": {
                "cost": "0.104", //для изменения цены меняем этот коэффициент
                "thickness": "10"
            },
            "19": {
                "cost": "0.105", //для изменения цены меняем этот коэффициент
                "thickness": "15"
            },
            "25": {
                "cost": "0.112", //для изменения цены меняем этот коэффициент
                "thickness": "21"
            },
            "32": {
                "cost": "0.12", //для изменения цены меняем этот коэффициент
                "thickness": "28"
            },
            "38": {
                "cost": "0.13", //для изменения цены меняем этот коэффициент
                "thickness": "34"
            },
            "50": {
                "cost": "0.174", //для изменения цены меняем этот коэффициент
                "thickness": "45"
            },
            "60": {
                "cost": "0.256", //для изменения цены меняем этот коэффициент
                "thickness": "55"
            },
            "76": {
                "cost": "0.412", //для изменения цены меняем этот коэффициент
                "thickness": "70"
            }
        },
        "wobbler-stem": {
            "price": "0.035",
            "rates": {
                "1-100": "3",
                "100-1000": "2",
                "1000-Infinity": "1.8"
            }
        }
    }
};

